const FaqBlock = require("./FaqBlock");

exports.default = function Faq({ ctx, name }) {  
  if(name == "backend")
    return (
      <div className="max-w-6xl mx-auto px-4 sm:px-6">
        <div className="py-8 md:py-8">
          <div className="md:gap-4">
            <div className="max-w-xl md:max-w-none md:w-full mx-auto md:col-span-7 lg:col-span-6 md:mt-6">
              <p className="px-2 mb-4 font-bold leading-tight text-2xl md:text-3xl text-right ltr:text-left">
                أسئلة متكررة
              </p>
              <div className="space-y-2">
                <FaqBlock
                  qst={"📌 كيف يمكنني التسجيل في التدريب؟"}
                  ans={["املأ الاستمارة الخاصة بالتدريب.", "بعد التسجيل، سنرسل لك RIB الخاص بالدفع.", "بعد تأكيد الدفع، أرسل لنا إثبات الدفع.", "ستتم إضافتك إلى مجموعة واتساب الخاصة بالمجموعة."]}
                />
                <FaqBlock
                  qst={"💳 ما هي طرق الدفع المتاحة؟"}
                  ans={["الدفع عن طريق تحويل بنكي (Virement Bancaire).", "يمكنك التواصل معنا في حال كنت بحاجة لمزيد من التفاصيل حول الدفع."]}
                />
                <FaqBlock
                  qst={"🤔 هل يجب أن أكون متمكناً من البرمجة قبل البدء؟"}
                  ans={["لا! هذا التدريب مصمم لجميع المستويات، حتى لو لم تكن لديك أي خبرة سابقة في البرمجة.", "📌 المدربون سيبدأون معك من الصفر، خطوة بخطوة حتى تصبح جاهزًا للعمل في المجال."]}
                />
                <FaqBlock
                  qst={"🏡 هل يجب أن أذهب إلى مكان معين لحضور التدريب؟"}
                  ans={["لا! التدريب 100% عن بُعد، يمكنك التعلم من أي مكان في المغرب (أو حتى من أي مكان في العالم).", "كل ما تحتاجه هو حاسوب واتصال بالإنترنت، ونحن سنكون معك في كل خطوة."]}
                />
                <FaqBlock
                  qst={"🎯 لماذا هذا التدريب هو الخيار المثالي لك؟"}
                  ans={["تعلم أسرع: في 3 أشهر فقط ستتمكن من تطوير تطبيقات حقيقية!", "تدريب عملي: مشاريع حقيقية لإضافة خبرة قوية إلى سيرتك الذاتية.", "مدربون محترفون: إرشاد مستمر من خبراء في المجال.", "شهادة معتمدة: لتعزيز فرصك في سوق العمل.", "فرص توظيف: تأهلك للحصول على وظيفة في مجال البرمجة بعد التدريب!"]}
                />
              </div>
            </div>
          </div>
        </div>
      </div>
    );
  return (
    <></>
  )
};
